[Killed] ConditionalExpression
unit-testing-playground/vite-jest-tester/src/App.tsx:73:12
           <button type="button" id={"fetch-users"} onClick={fetchUser}>
             Fetch User List
           </button>
-          {isLoading === "loading" ? (
+          {true ? (
             <pre>Fetching user list</pre>
           ) : (
killedBy: Simple working test should test that we fetch data from our mocked server
statusReason: Error: Unable to find an element with the text: /Number of records fetched: 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] EqualityOperator
unit-testing-playground/vite-jest-tester/src/App.tsx:73:12
           <button type="button" id={"fetch-users"} onClick={fetchUser}>
             Fetch User List
           </button>
-          {isLoading === "loading" ? (
+          {isLoading !== "loading" ? (
             <pre>Fetching user list</pre>
           ) : (
killedBy: Simple working test should test that we fetch data from our mocked server
statusReason: Error: Unable to find an element with the text: /Number of records fetched: 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] LogicalOperator
unit-testing-playground/vite-jest-tester/src/App.tsx:78:16
           ) : (
             <>
               <pre>Number of records fetched: {userData.length}</pre>
-              {userData.length > 0 && (
-                <table>
-                  <thead>
-                    <tr>
-                      <th>User ID</th>
-                      <th>Full Name</th>
-                      <th>Username</th>
-                      <th>Email</th>
-                    </tr>
-                  </thead>
-                  <tbody>
-                    {userData.map((user, index: number) => (
-                      <tr key={index}>
-                        <td>{user.id}</td>
-                        <td>{user.name}</td>
-                        <td>{user.username}</td>
-                        <td>{user.email}</td>
-                      </tr>
-                    ))}
-                  </tbody>
-                </table>
-              )}
+              {userData.length > 0 || <table>
+                  <thead>
+                    <tr>
+                      <th>User ID</th>
+                      <th>Full Name</th>
+                      <th>Username</th>
+                      <th>Email</th>
+                    </tr>
+                  </thead>
+                  <tbody>
+                    {userData.map((user, index: number) => <tr key={index}>
+                        <td>{user.id}</td>
+                        <td>{user.name}</td>
+                        <td>{user.username}</td>
+                        <td>{user.email}</td>
+                      </tr>)}
+                  </tbody>
+                </table>}
             </>
           )}
killedBy: Simple working test should test that we render a table with data from our mocked server
statusReason: Error: Unable to find an element with the text: /peter parker/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] EqualityOperator
unit-testing-playground/vite-jest-tester/src/App.tsx:78:16
           ) : (
             <>
               <pre>Number of records fetched: {userData.length}</pre>
-              {userData.length > 0 && (
+              {userData.length <= 0 && (
                 <table>
                   <thead>
killedBy: Simple working test should test that we render a table with data from our mocked server
statusReason: Error: Unable to find an element with the text: /peter parker/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] ArrowFunction
unit-testing-playground/vite-jest-tester/src/App.tsx:89:35
                     </tr>
                   </thead>
                   <tbody>
-                    {userData.map((user, index: number) => (
-                      <tr key={index}>
-                        <td>{user.id}</td>
-                        <td>{user.name}</td>
-                        <td>{user.username}</td>
-                        <td>{user.email}</td>
-                      </tr>
-                    ))}
+                    {userData.map(() => undefined)}
                   </tbody>
                 </table>
killedBy: Simple working test should test that we render a table with data from our mocked server
statusReason: Error: Unable to find an element with the text: /peter parker/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] BlockStatement
unit-testing-playground/vite-jest-tester/src/App.tsx:108:44
   );
 }
 
-function mapStateToProps(state: RootState) {
-  const { counter, login, user } = state;
-  return {
-    value: counter.value,
-    isLoggedIn: login.isLoggedIn,
-    userData: user.userData,
-    isLoading: user.status,
-  };
-}
+function mapStateToProps(state: RootState) {}
 
 const mapDispatchToProps = {
killedBy: Simple working test the title is visible
statusReason: TypeError: Cannot read property 'length' of undefined
