[Killed] BooleanLiteral
src/features/login/loginSlice.ts:6:17
 export const loginSlice = createSlice({
   name: "login",
   initialState: {
-    isLoggedIn: false,
+    isLoggedIn: true,
   },
   reducers: {
killedBy: loginSlice should return loginSlice initial state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "isLoggedIn": false,
+   "isLoggedIn": true,

[Killed] BlockStatement
src/features/login/loginSlice.ts:9:29
     isLoggedIn: false,
   },
   reducers: {
-    handleLogin: (state) => {
-      state.isLoggedIn = true;
-    },
+    handleLogin: (state) => {},
     handleLogout: (state) => {
       state.isLoggedIn = false;
killedBy: Simple working test should change nav button from login to logout
statusReason: Error: Unable to find an element with the text: /Logout/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] BooleanLiteral
src/features/login/loginSlice.ts:10:26
   },
   reducers: {
     handleLogin: (state) => {
-      state.isLoggedIn = true;
+      state.isLoggedIn = false;
     },
     handleLogout: (state) => {
killedBy: Simple working test should change nav button from login to logout
statusReason: Error: Unable to find an element with the text: /Logout/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] BlockStatement
src/features/login/loginSlice.ts:12:30
     handleLogin: (state) => {
       state.isLoggedIn = true;
     },
-    handleLogout: (state) => {
-      state.isLoggedIn = false;
-    },
+    handleLogout: (state) => {},
   },
 });
killedBy: loginSlice should perform logout action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "isLoggedIn": false,
+   "isLoggedIn": true,

[Killed] BooleanLiteral
src/features/login/loginSlice.ts:13:26
       state.isLoggedIn = true;
     },
     handleLogout: (state) => {
-      state.isLoggedIn = false;
+      state.isLoggedIn = true;
     },
   },
killedBy: loginSlice should perform logout action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "isLoggedIn": false,
+   "isLoggedIn": true,
