[Killed] BlockStatement
src/components/forms/MyForm.tsx:10:25
 
 export const MyForm = ({ onSubmit }: myFormProps) => {
   const handleSubmit = useCallback(
-    (values: object) => {
-      onSubmit(values);
-    },
+    (values: object) => {},
     [onSubmit]
   );
killedBy: Formik form sample test rendering and submitting a basic Formik form
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "john.dee@someemail.com", "firstName": "John", "lastName": "Dee"}

Number of calls: 0

Ignored nodes: comments, <script />, <style />
<html>

[Survived] ArrayDeclaration
src/components/forms/MyForm.tsx:13:5
     (values: object) => {
       onSubmit(values);
     },
-    [onSubmit]
+    []
   );
 
