[Killed] BlockStatement
src/components/nav/Nav.tsx:9:62
   onLogOut: () => void;
 };
 
-const Nav = ({ isLoggedIn, onLogIn, onLogOut }: NavProps) => {
-  return (
-    <nav className="menu">
-      <div>
-        {isLoggedIn ? (
-          <button id={"logout"} onClick={onLogOut}>
-            Logout
-          </button>
-        ) : (
-          <button id={"login"} onClick={onLogIn}>
-            Login
-          </button>
-        )}
-      </div>
-    </nav>
-  );
-};
+const Nav = ({ isLoggedIn, onLogIn, onLogOut }: NavProps) => {};
 
 export default memo(Nav);
killedBy: Simple working test should change nav button from login to logout
statusReason: Error: Unable to find an element with the text: /Logout/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="App"
    >
