[Killed] BlockStatement
src/features/counter/counterSlice.ts:9:27
     value: 0,
   },
   reducers: {
-    increment: (state) => {
-      state.value += 1;
-    },
+    increment: (state) => {},
     decrement: (state) => {
       state.value -= 1;
killedBy: Simple working test should increment count on click
statusReason: Error: Unable to find an element with the text: /counter value is: 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] AssignmentOperator
src/features/counter/counterSlice.ts:10:7
   },
   reducers: {
     increment: (state) => {
-      state.value += 1;
+      state.value -= 1;
     },
     decrement: (state) => {
killedBy: Simple working test should increment count on click
statusReason: Error: Unable to find an element with the text: /counter value is: 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] BlockStatement
src/features/counter/counterSlice.ts:12:27
     increment: (state) => {
       state.value += 1;
     },
-    decrement: (state) => {
-      state.value -= 1;
-    },
+    decrement: (state) => {},
     decrementByAmount: (state, action: PayloadAction<number>) => {
       state.value -= action.payload;
killedBy: counterSlice Should decrease counter value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": -1,
+   "value": 0,

[Killed] AssignmentOperator
src/features/counter/counterSlice.ts:13:7
       state.value += 1;
     },
     decrement: (state) => {
-      state.value -= 1;
+      state.value += 1;
     },
     decrementByAmount: (state, action: PayloadAction<number>) => {
killedBy: counterSlice Should decrease counter value
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": -1,
+   "value": 1,

[Killed] BlockStatement
src/features/counter/counterSlice.ts:15:66
     decrement: (state) => {
       state.value -= 1;
     },
-    decrementByAmount: (state, action: PayloadAction<number>) => {
-      state.value -= action.payload;
-    },
+    decrementByAmount: (state, action: PayloadAction<number>) => {},
     incrementByAmount: (state, action: PayloadAction<number>) => {
       state.value += action.payload;
killedBy: counterSlice Should decrease counter value by a specific amount
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": -100,
+   "value": 0,

[Killed] AssignmentOperator
src/features/counter/counterSlice.ts:16:7
       state.value -= 1;
     },
     decrementByAmount: (state, action: PayloadAction<number>) => {
-      state.value -= action.payload;
+      state.value += action.payload;
     },
     incrementByAmount: (state, action: PayloadAction<number>) => {
killedBy: counterSlice Should decrease counter value by a specific amount
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": -100,
+   "value": 100,

[Killed] BlockStatement
src/features/counter/counterSlice.ts:18:66
     decrementByAmount: (state, action: PayloadAction<number>) => {
       state.value -= action.payload;
     },
-    incrementByAmount: (state, action: PayloadAction<number>) => {
-      state.value += action.payload;
-    },
+    incrementByAmount: (state, action: PayloadAction<number>) => {},
   },
 });
killedBy: counterSlice Should increase counter value by a specific amount
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 100,
+   "value": 0,

[Killed] AssignmentOperator
src/features/counter/counterSlice.ts:19:7
       state.value -= action.payload;
     },
     incrementByAmount: (state, action: PayloadAction<number>) => {
-      state.value += action.payload;
+      state.value -= action.payload;
     },
   },
killedBy: counterSlice Should increase counter value by a specific amount
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "value": 100,
+   "value": -100,
