[Killed] ArrowFunction
src/features/user/userSlice.tsx:4:17
 import { createSlice, createAsyncThunk } from "@reduxjs/toolkit";
 import axios from "axios";
 
-const userApi = () =>
-  axios({
-    method: "GET",
-    url: "https://jsonplaceholder.typicode.com/users",
-  });
+const userApi = () => undefined;
 
 export const fetchUser = createAsyncThunk("user/fetchUser", async () => {
killedBy: Simple working test should test that we fetch data from our mocked server
statusReason: Error: Unable to find an element with the text: /Number of records fetched: 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Killed] BlockStatement
src/features/user/userSlice.tsx:10:73
     url: "https://jsonplaceholder.typicode.com/users",
   });
 
-export const fetchUser = createAsyncThunk("user/fetchUser", async () => {
-  const { data } = await userApi();
-  return data;
-});
+export const fetchUser = createAsyncThunk("user/fetchUser", async () => {});
 
 const initialState = {
killedBy: Simple working test should test that we fetch data from our mocked server
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] BlockStatement
src/features/user/userSlice.tsx:31:31
   name: "user",
   initialState: initialState,
   reducers: {},
-  extraReducers: (builder) => {
-    builder.addCase(fetchUser.pending, (state) => {
-      state.status = "loading";
-    });
-    builder.addCase(fetchUser.fulfilled, (state, action) => {
-      state.status = "complete";
-      state.userData = action.payload;
-    });
-  },
+  extraReducers: (builder) => {},
 });
 
killedBy: Simple working test should test that we fetch data from our mocked server
statusReason: Error: Unable to find an element with the text: /Number of records fetched: 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >

[Survived] BlockStatement
src/features/user/userSlice.tsx:32:51
   initialState: initialState,
   reducers: {},
   extraReducers: (builder) => {
-    builder.addCase(fetchUser.pending, (state) => {
-      state.status = "loading";
-    });
+    builder.addCase(fetchUser.pending, (state) => {});
     builder.addCase(fetchUser.fulfilled, (state, action) => {
       state.status = "complete";

[Killed] BlockStatement
src/features/user/userSlice.tsx:35:61
     builder.addCase(fetchUser.pending, (state) => {
       state.status = "loading";
     });
-    builder.addCase(fetchUser.fulfilled, (state, action) => {
-      state.status = "complete";
-      state.userData = action.payload;
-    });
+    builder.addCase(fetchUser.fulfilled, (state, action) => {});
   },
 });
killedBy: Simple working test should test that we fetch data from our mocked server
statusReason: Error: Unable to find an element with the text: /Number of records fetched: 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="menu"
    >
