[Survived] ArrayDeclaration
unit-testing-playground/vite-jest-tester/src/store.ts:8:15
 import userReducer from "./features/user/userSlice";
 
 const store = configureStore({
-  middleware: [thunk],
+  middleware: [],
   reducer: {
     counter: counterReducer,
