[Killed] ArrowFunction
vite-jest-tester/src/utils/test-utils.tsx:23:22
   store?: any;
 }
 
-const customRender = (
-  ui: React.ReactElement,
-  {
-    preloadedState,
-    store = configureStore({
-      middleware: (getDefaultMiddleware) =>
-        getDefaultMiddleware({ serializableCheck: false }),
-      reducer: {
-        counter: counterReducer,
-        login: loginReducer,
-        user: userReducer,
-      },
-      preloadedState,
-    }),
-    ...renderOptions
-  }: ExtendedRenderOptions = {}
-) =>
-  render(ui, {
-    // wrap provider(s) here if needed
-    wrapper: ({ children }) => <Provider store={store}>{children}</Provider>,
-    ...renderOptions,
-  });
+const customRender = () => undefined;
 
 export * from "@testing-library/react";
killedBy: Formik form sample test renders the form without crashing
statusReason: TestingLibraryElementError: Unable to find a label with the text of: /First Name/i

Ignored nodes: comments, <script />, <style />
<body />

[Killed] ArrowFunction
vite-jest-tester/src/utils/test-utils.tsx:28:19
   {
     preloadedState,
     store = configureStore({
-      middleware: (getDefaultMiddleware) =>
-        getDefaultMiddleware({ serializableCheck: false }),
+      middleware: () => undefined,
       reducer: {
         counter: counterReducer,
killedBy: Formik form sample test renders the form without crashing
statusReason: Error: when using a middleware builder function, an array of middleware must be returned

[Survived] BooleanLiteral
vite-jest-tester/src/utils/test-utils.tsx:29:51
     preloadedState,
     store = configureStore({
       middleware: (getDefaultMiddleware) =>
-        getDefaultMiddleware({ serializableCheck: false }),
+        getDefaultMiddleware({ serializableCheck: true }),
       reducer: {
         counter: counterReducer,

[Killed] ArrowFunction
vite-jest-tester/src/utils/test-utils.tsx:42:14
 ) =>
   render(ui, {
     // wrap provider(s) here if needed
-    wrapper: ({ children }) => <Provider store={store}>{children}</Provider>,
+    wrapper: () => undefined,
     ...renderOptions,
   });
killedBy: Input should render the input
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email Address. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>
