[Killed] BlockStatement
src/components/input/Input.tsx:11:72
   HTMLInputElement
 >;
 
-export const Input = ({ label, name, error, ...props }: InputProps) => {
-  return (
-    <>
-      <label htmlFor={name}>{label}</label>
-      <input name={name} id={name} {...props} />
-      {error ? <span role="alert">{error}</span> : null}
-    </>
-  );
-};
+export const Input = ({ label, name, error, ...props }: InputProps) => {};
 
killedBy: Input should render the input
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email Address. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>
